OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/multiphase/interFoam/RAS/electrostaticDeposition/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    metalSheet
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    "side-.*"
    {
        type            inletOutlet;
        inletValue      uniform 1e-3;
        value           uniform 1e-3;
    }
}


// ************************************************************************* //
